src/alpine.org
:PROPERTIES:
:ID:       9e3b6103-7bb3-4f2f-bf2e-1ce755f70384
:END:
#+TITLE: Lightweight timezone-aware containers
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle lib/alpine.py
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

I need containers where logs and cron jobs use the correct timezone by
default, without having to configure it in every project. Alpine is my
go-to base image because it's small and fast to pull. The timezone
defaults to Europe/Paris but is configurable via the =Lib.timezone=
field.

#+begin_src python
import dagger
from dagger import dag, function
#+end_src

* Setting the timezone on Alpine
  :PROPERTIES:
  :ID:       e4e79d12-b0d3-4121-981c-90de5dfd4246
  :END:

  On Alpine, timezone data comes from the =tzdata= package. We install it,
  copy the zoneinfo file, then remove the package to keep the image small.

  [[https://docs.dagger.io/api/reference#definition-Container][.with_exec]] runs a shell command inside the container — the
  equivalent of =RUN= in a Dockerfile. Here it installs =tzdata=, copies
  the zoneinfo file, and removes the package in a single step so the
  final image stays small.

  #+begin_src python
  @function
  def alpine_set_tz(self, ctr: dagger.Container) -> dagger.Container:
      """Set timezone on an Alpine container (uses Lib.timezone)."""
      tz = self.timezone
      return ctr.with_exec([
          "sh", "-c",
          "apk --quiet add --update tzdata"
          f" && cp /usr/share/zoneinfo/{tz} /etc/localtime"
          f' && echo "{tz}" > /etc/timezone'
          " && apk --quiet del tzdata",
      ])
  #+end_src

  We can verify the timezone is correctly set:

  #+NAME: alpine_timezone
  #+begin_src fixtureyaml
func: alpine
chain:
  - with-exec: [cat, /etc/timezone]
  - stdout
  #+end_src

  #+RESULTS[1713d76d13c912707056a7da0e52576cd98eca78]: alpine_timezone
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine with-exec --args="cat","/etc/timezone" stdout
  #+end_src

  #+RESULTS[edceca51788f31fff4bb68c4a0d2b6971d923738]:
  : Europe/Paris
  :end:

* A base Alpine container with optional extra packages
  :PROPERTIES:
  :ID:       fcb8570e-2515-4a0f-a703-4b6ed673464a
  :END:

  Sometimes I need additional tools. The =alpine= target gives me a
  timezone-ready Alpine with an easy way to add packages.

  [[https://docs.dagger.io/api/reference#definition-Container][dag.container()]] creates a new empty container — the starting point
  for every pipeline step. [[https://docs.dagger.io/api/reference#definition-Container][.from_]] sets the base image, like =FROM= in
  a Dockerfile. We chain =with_exec= to install any extra packages the
  caller requested.

  #+begin_src python
  @function
  def alpine(self, distro_packages: list[str] = ()) -> dagger.Container:
      """Alpine with timezone set and optional extra packages."""
      ctr = dag.container().from_(f"alpine:{self.alpine_version}")
      ctr = self.alpine_set_tz(ctr)
      if distro_packages:
          ctr = ctr.with_exec(["apk", "--quiet", "add"] + list(distro_packages))
      return ctr
  #+end_src

  #+NAME: alpine_distro_packages
  #+begin_src fixtureyaml
func: alpine
args:
  distro-packages: [curl]
chain:
  - with-exec: [which, curl]
  - stdout
  #+end_src

  #+RESULTS[08aa47b91718715981668a455eda0715fdaf77db]: alpine_distro_packages
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine --distro-packages=curl with-exec --args="which","curl" stdout
  #+end_src

  #+RESULTS[200c50ddd922bfbca5025152685fe86be635771f]:
  : /usr/bin/curl
  :end:

* A non-root user for safer workflows
  :PROPERTIES:
  :ID:       53e17e2e-2890-4b31-a125-fd02a0265c3a
  :END:

  Running as root in containers is risky. I want a default user ready to
  go, so I don't have to repeat user-creation boilerplate.

  #+begin_src python
  @function
  def alpine_user(
      self,
      distro_packages: list[str] = (),
      groups: list[str] = (),
      uid: int = 1000,
  ) -> dagger.Container:
      """Alpine with a default user."""
      ctr = self.alpine(distro_packages=distro_packages)
      return self.use_user(ctr, uid=uid, groups=groups)
  #+end_src

  #+NAME: alpine_user_check
  #+begin_src fixtureyaml
func: alpine-user
chain:
  - with-exec: ["id", sam]
  - stdout
  #+end_src

  #+RESULTS[785ecabca308136d490fbb94e1d4348ee96d0d1e]: alpine_user_check
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-user with-exec --args="id","sam" stdout
  #+end_src

  #+RESULTS[b11dd3ac761d5ca466b7f65120a379da8603ae4c]:
  : uid=1000(sam) gid=1000(sam) groups=1000(sam),1000(sam)
  :end:

  #+NAME: alpine_user_uid
  #+begin_src fixtureyaml
func: alpine-user
args:
  uid: 2000
chain:
  - with-exec: [id, -u]
  - stdout
  #+end_src

  #+RESULTS[f8c927f7a7f73bedd2e30ee927d565a94fb60950]: alpine_user_uid
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-user --uid=2000 with-exec --args="id","-u" stdout
  #+end_src

  #+RESULTS[c6489384c3e197763e06bc15ff62c070c2c11394]:
  : 2000
  :end:

* Timezone artifacts for other containers
  :PROPERTIES:
  :ID:       4bd886bd-2213-484a-900e-c3cac400e5a6
  :END:

  Some containers (like distroless) can't run =apk=. I need to extract the
  timezone files from Alpine so I can copy them in.

  [[https://docs.dagger.io/api/reference#definition-Container][.file(path)]] pulls a single file out of a container as a [[https://docs.dagger.io/api/reference#definition-File][File]]
  artifact. [[https://docs.dagger.io/api/reference#definition-Directory][dag.directory()]] creates a new empty Directory and
  [[https://docs.dagger.io/api/reference#definition-Directory][.with_file]] adds files into it. Together they let us bundle timezone
  files extracted from Alpine so other containers can import them.

  #+begin_src python
  @function
  def alpine_tz(self) -> dagger.Directory:
      """Extract /etc/localtime and /etc/timezone from Alpine as artifacts."""
      ctr = self.alpine()
      return (
          dag.directory()
          .with_file("localtime", ctr.file("/etc/localtime"))
          .with_file("timezone", ctr.file("/etc/timezone"))
      )
  #+end_src

  #+NAME: alpine_tz_export
  #+begin_src fixtureyaml
func: alpine-tz
chain:
  - export: $TMP/out
post: ls "$TMP/out" | sort
  #+end_src

  #+RESULTS[0d46007e31434b56ca64560cf721fa4de2690aef]: alpine_tz_export
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-tz export --path="$TMP/out" > /dev/null
  ls "$TMP/out" | sort
  #+end_src

  #+RESULTS[501fd8e2b72c5b4334e89b88212de0d39472e2e0]:
  : localtime
  : timezone
  :end:

* Python on Alpine
  :PROPERTIES:
  :ID:       f1cfb55f-ec94-48d1-a946-3da5601ce932
  :END:

  I often need a quick Python environment on Alpine for scripts and tools.

  #+begin_src python
  @function
  def alpine_python(self, distro_packages: list[str] = ()) -> dagger.Container:
      """Alpine with python3 and pip."""
      return self.alpine(distro_packages=["python3", "py3-pip"] + list(distro_packages))
  #+end_src

  #+NAME: alpine_python_check
  #+begin_src fixtureyaml
func: alpine-python
chain:
  - with-exec: [python3, --version]
  - stdout
  #+end_src

  #+RESULTS[ce1cdd33de659d3d3454c9dd82be9c15a7cea23f]: alpine_python_check
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-python with-exec --args="python3","--version" stdout
  #+end_src

  #+RESULTS[830ae8dc6a0872480c157b5d386af8631ad6cee7]:
  : Python 3.12.12
  :end:

* Python with a user and virtualenv
  :PROPERTIES:
  :ID:       9ad0ca24-648d-4092-8acf-2143f4a27040
  :END:

  For application development, I want a full setup: Alpine + Python + a
  non-root user + a virtualenv ready at =/app/venv=.

  [[https://docs.dagger.io/api/reference#definition-Container][.with_workdir]] changes the container's working directory — like
  =WORKDIR= in a Dockerfile. Setting it to =/app= means subsequent
  commands and the virtualenv land in the right place.

  #+begin_src python
  @function
  def alpine_python_user_venv(
      self,
      distro_packages: list[str] = (),
      groups: list[str] = (),
      pip_packages: list[str] = (),
      work_dir: str = "/app",
  ) -> dagger.Container:
      """Alpine with python, user, and a virtualenv."""
      ctr = self.alpine_python(distro_packages=distro_packages)
      return self.python_user_venv(ctr, groups=groups, pip_packages=pip_packages, work_dir=work_dir)
  #+end_src

  #+NAME: alpine_python_user_venv_check
  #+begin_src fixtureyaml
func: alpine-python-user-venv
chain:
  - with-exec: [sh, -c, "test -d /app/venv && /app/venv/bin/python --version"]
  - stdout
  #+end_src

  #+RESULTS[08993d5c749ec2121caa66897c5a6dc7890bbb6f]: alpine_python_user_venv_check
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-python-user-venv with-exec --args="sh","-c","test -d /app/venv && /app/venv/bin/python --version" stdout
  #+end_src

  #+RESULTS[2e20e636df872a948b9a17f1b5a7237c28361ef0]:
  : Python 3.12.12
  :end:
